{
  "name": "Junkrat",
  "slug": "junkrat",
  "title": "Junker Demolitionist",
  "description": null,
  "role": null,
  "type": null,
  "franchise": "Overwatch",
  "difficulty": "Medium",
  "live": true,
  "poster_image": "http://media.blizzard.com/heroes/junkrat/bust.jpg",
  "stats": {
    "damage": 7,
    "utility": 8,
    "survivability": 5,
    "complexity": 6
  },
  "trait": {
    "name": "Total Mayhem",
    "description": "Total Mayhem",
    "slug": "total-mayhem",
    "image": "http://media.blizzard.com/heroes/junkrat/abilities/icons/total-mayhem.png"
  },
  "abilities": [
    {
      "name": "Frag Launcher",
      "description": "Launch a grenade that explodes at the end of its path or upon hitting an enemy, dealing 128 damage to nearby enemies. Grenades can ricochet off of terrain. Deals 50% less damage to Structures. Stores up to 4 charges. Frag Launcher's cooldown replenishes all charges at the same time.",
      "slug": "frag-launcher",
      "image": "http://media.blizzard.com/heroes/junkrat/abilities/icons/frag-launcher.png"
    },
    {
      "name": "Concussion Mine",
      "description": "Place a mine on the ground. Junkrat's Trait can be activated to detonate the mine, dealing 180 damage to nearby enemies and knocking them back. Junkrat can also be affected by Concussion Mine, but takes no damage. Limit 1 active mine.",
      "slug": "concussion-mine",
      "image": "http://media.blizzard.com/heroes/junkrat/abilities/icons/concussion-mine.png"
    },
    {
      "name": "Steel Trap",
      "description": "Place a trap on the ground that arms after 2 seconds. Deals 130 damage to the first enemy that walks over it and Roots them for 2 seconds. Limit 1 active trap.",
      "slug": "steel-trap",
      "image": "http://media.blizzard.com/heroes/junkrat/abilities/icons/steel-trap.png"
    }
  ],
  "heroics": [
    {
      "name": "RIP-Tire",
      "description": "Create a motorized bomb with 530 Health that lasts 15 seconds. While active, Junkrat is immobile but gains control of RIP-Tire's movement. RIP-Tire can be reactivated to detonate immediately, knocking nearby enemies back and dealing 475, 625, or 775 damage to enemies depending on how close they are to the center of the blast (with the highest amount near the center).",
      "slug": "rip-tire",
      "image": "http://media.blizzard.com/heroes/junkrat/abilities/icons/rip-tire.png"
    },
    {
      "name": "Rocket Ride",
      "description": "After 1.25 seconds, Junkrat launches into the air. While in the air, he can steer the landing location by moving. After 3.5 seconds, Junkrat lands, dealing 750 damage to nearby enemies and activating Total Mayhem. 5 seconds after landing, Junkrat reappears at the Altar and gains 150% additional Movement Speed until dismounted.",
      "slug": "rocket-ride",
      "image": "http://media.blizzard.com/heroes/junkrat/abilities/icons/rocket-ride.png"
    }
  ]
}